// config.js - 公路数据配置文件
const config = {
    background: {
        // 直接指定背景图URL（可以是本地路径或网络URL）
        url: 'image/地图.jpg', // 替换为您的背景图路径
        width: 1200,
        height: 800
    },
    //路线组，你可以按格式创建更多分类
    groups: [
        { id: '冰高速', name: '冰高速', color: '#3498db', visible: true,},
        { id: '国道', name: '国道', color: '#e74c3c', visible: true },
        { id: '主要城市', name: '城市', color: '#c7c0bfff', visible: true },
        // { id: '唯一识别码，这个不可以重名', name: '实际显示的名字', color: '#2ecc71颜色代码呃你随便怎么写', visible: true或者false，是否在网页端显示这条线 }
    ],
    highways: [
        // {
        //     id: 'hw1',
        //     name: '京哈高速',
        //     group: 'highway',
        //     path: [[150, 250], [350, 400], [600, 350], [800, 450]],
        //     width: 8,
        //     info: `<h3>京哈高速公路</h3>
        //            <p><strong>编号：</strong>G1</p>
        //            <p><strong>起点：</strong>北京</p>
        //            <p><strong>终点：</strong>哈尔滨</p>
        //            <p><strong>全长：</strong>1200公里</p>
        //            <p><strong>说明：</strong>连接北京、沈阳、长春、哈尔滨的重要高速公路干线</p>`
        // },
        {
            id: '喀什支线',//唯一识别码，这个不可以重名
            name: '喀什支线',//实际显示的名字，这个可以重名
            group: '冰高速',//所属分组，看最上面的分组说明
            //↓这里写公路折线的所有端点，不支持曲线（用曲线也不好看不容易控制）↓
            //用电脑自带《画图》打开，选择取色器或其它什么的在1200*800的图片上移动，左下角就能看见当前坐标，直接抄进方括号里就行
            path: [[21, 370], [84, 370], [89, 360], [126, 358], [127, 350],[142,350],[147,345],[157,345],[157,335],[173,335],[173,323],[196,321],[201,315],[211,315],[250,315],[250,317],[270,315],[270,308],[292,308],[292,315],[314,315],[338,315]],
            width: 3,//线段宽度
            info:
                `
                    <h3>G0711喀什支线</h3>
                   <p><strong>类别：</strong>支线</p>
                   <p><strong>起点：</strong>G7京新高速乌鲁木齐东南立交桥</p>
                   <p><strong>终点：</strong>新疆维吾尔自治区喀什地区（连通边境）</p>
                   <p><strong>途径城市：</strong>（暂无可发展城市）</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速</p>
                   <p><strong>简介：</strong>有望成为连通欧洲、非洲的中国支线高速公路</p>
                `,
            landmarkIds: ['G0711'], // 绑定地标ID
        },
        {
            id: '沪霍',
            name: '沪霍高速',
            group: '冰高速',
            path: [
            [142, 272], [172, 272], [172, 256], [210, 256],[211,315],[250,314],[250,317],[270,315],[270,308],[292,308],[292,314],[314,314],[314,344],[393,344],[393,354],[421,354],[421,359],[445,360],[450,371],[521,372],[521,382],[530,383],[530,395],[536,395],[536,402],[664,408],[745,408],[747,428],[790,429],[790,573],[795,573],[795,564],[910,564]
            ],
            width: 3,
            info: `                    <h3>G30沪霍高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>上海</p>
                   <p><strong>终点：</strong>新疆维吾尔自治区伊犁哈萨克自治州霍尔果斯市</p>
                   <p><strong>途径城市：</strong>上海、合肥、武汉、延安、乌鲁木齐、霍尔果斯</p>
                   <p><strong>途径路段被共线高速：</strong>S1（新高速）、乌鲁木齐西支线、G0711喀什支线、G55二广高速、G42沪蓉高速</p>
                   <p><strong>简介：</strong>中国最长高速公路</p>`
        },
        {
            id: '乌鲁木齐绕城',
            name: 'G0701乌市环线',
            group: '冰高速',
            path: [
            [210, 255], [210,243],[215,237],[260,236],[260,243],[279,245],[279,254],[290,254],[290,273],[286,275],[260,276],[253,271],[238,270],[236,266],[210,265],[210, 255]
            ],
            width: 3,
            info: `                    
                   <h3>G0701乌市环线</h3>
                   <p><strong>类别：</strong>环城高速</p>
                   <p><strong>起点：</strong>---</p>
                   <p><strong>终点：</strong>---</p>
                   <p><strong>途径城市：</strong>乌鲁木齐</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速、G7京新高速</p>
                   <p><strong>简介：</strong>中国第一条环城高速公路</p>`
        },
        {
            id: 'G7',
            name: 'G7京新高速',
            group: '冰高速',
            path: [
            [290, 269], [335,270],[337,315],[494,327],[496,339],[570,337],[574,347],[611,346],[613,349],[643,350],[655,362],[704,361],[706,356],[750,356],[756,364],[756,379],[802,379],[810,356],[828,356]
            ],
            width: 3,
            info: `                    
                   <h3>G7京新高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>乌鲁木齐</p>
                   <p><strong>途径城市：</strong>北京、张家口、呼和浩特、乌海市、乌鲁木齐</p>
                   <p><strong>途径路段被共线高速：</strong>G6京藏高速</p>
                   <p><strong>简介：</strong>中国第一条跨沙漠高速公路</p>`
        },
        {
            id: 'G1',
            name: 'G1京哈高速',
            group: '冰高速',
            path: [
            [1043, 225], [1043,267],[956,267],[954,339],[981,339],[954,339],[954,382],[941,384],[941,394],[862,395]
            ],
            width: 3,
            info: `                    
                   <h3>G1京哈高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>哈尔滨</p>
                   <p><strong>途径城市：</strong>哈尔滨、大庆、北京</p>
                   <p><strong>途径路段被共线高速：</strong>G13哈海高速、G45大广高速、G4京港澳高速</p>
                   <p><strong>简介：</strong>包含渤海湾跨海大桥的主线高速</p>
                   `
        },
        {
            id: 'G45',
            name: 'G45大广高速',
            group: '冰高速',
            path: [
            [784, 704],[784,611],[836,611],[836,516],[843,516],[843,437],[845,437],[845,429],[862,429],
            [862,395],[941,394],[941,384],[954,382],[956,243],
            ],
            width: 3,
            landmarkIds: ['G45'],
            info: `                    
                   <h3>G45大广高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>黑龙江省大庆市</p>
                   <p><strong>终点：</strong>广州</p>
                   <p><strong>途径城市：</strong>大庆、郑州、深圳、广州</p>
                   <p><strong>途径路段被共线高速：</strong>G1京哈高速、G13哈海高速、G55二广高速、G4京港澳高速</p>
                   <p><strong>简介：</strong>中国南北走向冰高速路中全线被共线（仅次于京港澳高速）</p>
                   `
        },
        {
            id: 'G4',
            name: 'G4京港澳高速',
            group: '冰高速',
            path: [
            [862,395],[846,395],[844,436],[836,438],[835,444],[830,445],[829,483],[822,484],[822,498],[834,498],[835,498],[835,490],[822,490],[822,550],[816,557],[816,603],[805,633],[805,671],[814,686],[814,730],[791,730],[791,739],[782,739]
            ],
            width: 3,
            info: `                    
                   <h3>G4京港澳高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>深圳</p>
                   <p><strong>途径城市：</strong>北京、郑州、深圳</p>
                   <p><strong>途径路段被共线高速：</strong>G1京哈高速、G2京沪高速、G3京台高速、G5京昆高速、G14沪拉高速、G45大广高速、G13哈海高速</p>
                   <p><strong>简介：</strong>中国第一条高速公路（开山鼻祖）</p>
                   `
        },
        {
            id: 'G3',
            name: 'G3京台高速',
            group: '冰高速',
            path: [
            [862,395],[846,395],[844,436],[836,438],[835,444],[830,445],[829,483],[822,484],[822,498],[834,498],[835,498],[835,490],[822,490],[822,550],[816,557],[816,603],[805,633],[805,671],[814,686],[814,704],[921,704],
            ],
            width: 3,
            info: `                    
                   <h3>G3京台高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>台北</p>
                   <p><strong>途径城市：</strong>北京、郑州、台北</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速</p>
                   <p><strong>简介：</strong>与G0迪台国际高速共用一个起点，也是唯一一条通向台湾的冰高速</p>
                   `
        },
        {
            id: 'G13',
            name: 'G13哈海高速',
            group: '冰高速',
            path: [
            [712,796],[712,758],[757,757],[757,754],[768,754],[768,746],[782,746],
            [782,739],[791,739],[791,730],[814,730],[814,686],[805,671],[805,633],[816,603],[816,557],[822,550],[822,490],[822,484],[829,483],[830,445],[835,444],[836,438],[844,436],[846,395],[862,395],
            ],
            width: 3,
            info: `                    
                   <h3>G13哈海高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>哈尔滨</p>
                   <p><strong>终点：</strong>海口市</p>
                   <p><strong>途径城市：</strong>哈尔滨、大庆、北京、郑州、深圳、广州、海口</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速、G1京哈高速、G45大广高速</p>
                   <p><strong>简介：</strong>第一条到海南的高速公路</p>
                   `
        },
    ]
};