// offsetConfig.js - 偏移配置文件
const offsetConfig = {
    // 全局偏移（应用于所有元素）
    globalOffset: [0, 0], // [x, y] 偏移量

    // 特定元素的偏移（覆盖全局偏移）
    specificOffsets: {
        // 公路偏移
        highways: {
            'G0711': [5, 30], // 公路ID: [x偏移, y偏移]
            'G30沪霍': [5, 30],
            '乌鲁木齐绕城': [5, 30],
            'G7': [5, 30],
            'G1': [5, 30],
            'G45': [5, 30],
            'G4': [5, 30],
            'G13': [5, 30],
            'G3': [5, 30],
            'G2': [5, 30],
            'G55': [5, 30],
            'G5': [5, 30],
            'G75': [5, 30],
            'G14': [5, 30],
            'S2': [5, 30],
            'G67': [5, 30],
            'G42': [5, 30],
            'G17': [5, 30],
            //混凝土国道
            'G102': [3, 16],
            // 添加更多公路偏移...
        },

        // 地标偏移
        landmarks: {
            // 添加更多地标偏移...
            'G0711': [5, 30], 
            'G30': [5, 30],
            '乌鲁木齐绕城': [5, 30],
            'G7京新高速': [5, 30],
            'G1': [5, 30],
            'G45': [5, 30],
            'G4': [5, 30],
            'G13': [5, 30],
            'G3': [5, 30],
            'G2': [5, 30],
            'G55': [5, 30],
            'G5': [5, 30],
            'G75': [5, 30],
            'G14': [5, 30],
            'S2': [5, 30],
            'G67': [5, 30],
            'G42': [5, 30],
            'G17': [5, 30],
        }
    }
};

export default offsetConfig;