// 公路数据配置文件
let config = {
    background: {
        // 直接指定背景图URL（可以是本地路径或网络URL）
        url: 'image/地图.png', // 替换为您的背景图路径
    },
    //路线组，你可以按格式创建更多分类
    分组设置: [
        { id: '冰高速', 名称: '高速公路', color: '#6cb5e6ff', visible: true, },
        { id: '混凝土国道', 名称: '国道', color: '#292929ff', visible: true },
        { id: '其他公路', 名称: '其他公路', color: '#363636', visible: false },
        { id: '主要城市', 名称: '城市', color: '#c7c0bfff', visible: true },
        // { id: '唯一识别码，这个不可以重名', 名称: '实际显示的名字', color: '#2ecc71颜色代码呃你随便怎么写', visible: true或者false，是否在网页端显示这条线 }
    ],
    highways: [
        {
            id: 'G0711',//唯一识别码，这个不可以重名    （因为在landmarks.js里也有一个id: 'G0711'，所以下面的landmarkIds不需要再特意指定G0711）
            绑定图标ID: [''],//指定绑定的图标，绑定后选中可以共同高亮显示。如果landmarks.js里图标的id和公路一样则不需要指定这个，默认绑定
            名称: '喀什支线',//实际显示的名字，这个可以重名
            分组: '冰高速',//所属分组，看最上面的分组说明
            //↓这里写公路折线的所有端点，不支持曲线（用曲线也不好看不容易控制）↓
            //用电脑自带《画图》打开，选择取色器或其它什么的在1200*800的图片上移动，左下角就能看见当前坐标，直接抄进方括号里就行
            path: [[5, 370], [84, 370], [89, 360], [126, 358], [127, 350], [142, 350], [147, 345], [157, 345], [157, 335], [173, 335], [173, 323], [196, 321], [201, 315], [211, 315], [250, 315], [250, 317], [270, 315], [270, 308], [292, 308], [292, 315], [314, 315], [338, 315]],
            公路宽度: 3,//线段宽度
            信息:
                `
                    <h3>G0711喀什支线</h3>
                   <p><strong>类别：</strong>支线</p>
                   <p><strong>起点：</strong>G7京新高速乌鲁木齐东南立交桥</p>
                   <p><strong>终点：</strong>新疆维吾尔自治区喀什地区（连通边境）</p>
                   <p><strong>途径城市：</strong>（暂无可发展城市）</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速</p>
                   <p><strong>简介：</strong>有望成为连通欧洲、非洲的中国支线高速公路</p>
                `,
        },
        {
            id: 'G30沪霍',//如果有图标的id也是这个，那么你就可以去掉下面的landmarkIds了（你会自动绑定到那个图标上），这里因为ID不一样，所以必须指定图标ID，否则点击线段只会高亮显示线段，图标是不会跟着亮起来的，而且还会被高亮显示的线段遮住（不会有人喜欢这个吧）
            名称: 'G30沪霍高速',
            分组: '冰高速',
            绑定图标ID: ['G30', 'G30的立交桥'],//冷知识：你可以同时绑定多个图标，你甚至可以这样写['G30','G7京新高速'...]，点击线段会带着图标们一起高亮
            path: [
                [142, 272], [172, 272], [172, 250], [202, 250], [202, 262], [210, 262], [211, 315], [250, 314], [250, 317], [270, 315], [270, 308], [292, 308], [292, 314], [314, 314], [314, 344], [393, 344], [393, 354], [421, 354], [421, 359], [445, 360], [450, 371], [521, 372], [521, 382], [530, 383], [530, 395], [536, 395], [536, 402], [664, 408], [745, 408], [747, 428], [790, 429], [790, 573], [795, 573], [795, 564], [910, 564]
            ],
            公路宽度: 3,
            信息: `                    <h3>G30沪霍高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>上海</p>
                   <p><strong>终点：</strong>新疆维吾尔自治区伊犁哈萨克自治州霍尔果斯市</p>
                   <p><strong>途径城市：</strong>上海、合肥、武汉、延安、乌鲁木齐、霍尔果斯</p>
                   <p><strong>途径路段被共线高速：</strong>S1（新高速）、乌鲁木齐西支线、G0711喀什支线、G55二广高速、G42沪蓉高速</p>
                   <p><strong>简介：</strong>中国最长高速公路</p>`
        },
        {
            id: '乌鲁木齐绕城',//landmarks.js里也有一个id: '乌鲁木齐绕城'，因此不写landmarkIds字段
            名称: 'G0701乌市环线',
            分组: '冰高速',
            path: [
                [210, 255], [210, 243], [215, 237], [260, 236], [260, 243], [279, 245], [279, 254], [290, 254], [290, 273], [286, 275], [260, 276], [253, 271], [238, 270], [236, 266], [210, 265], [210, 255]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G0701乌市环线</h3>
                   <p><strong>类别：</strong>环城高速</p>
                   <p><strong>起点：</strong>---</p>
                   <p><strong>终点：</strong>---</p>
                   <p><strong>途径城市：</strong>乌鲁木齐</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速、G7京新高速</p>
                   <p><strong>简介：</strong>中国第一条环城高速公路</p>`
        },
        {
            id: 'G7',
            名称: 'G7京新高速',
            分组: '冰高速',
            绑定图标ID: ['G7的立交桥'],
            path: [
                [290, 269], [335, 270], [337, 315], [494, 327], [496, 339], [570, 337], [574, 347], [611, 346], [613, 349], [643, 350], [655, 362], [704, 361], [706, 356], [750, 356], [756, 364], [756, 379], [802, 379], [810, 356], [828, 356]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G7京新高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>乌鲁木齐</p>
                   <p><strong>途径城市：</strong>北京、张家口、呼和浩特、乌海市、乌鲁木齐</p>
                   <p><strong>途径路段被共线高速：</strong>G6京藏高速</p>
                   <p><strong>简介：</strong>中国第一条跨沙漠高速公路</p>`
        },
        {
            id: 'G1',
            名称: 'G1京哈高速',
            分组: '冰高速',
            path: [
                [1043, 225], [1043, 267], [956, 267], [954, 330], [981, 330], [954, 330], [954, 368], [941, 375], [936, 390], [862, 395]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G1京哈高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>哈尔滨</p>
                   <p><strong>途径城市：</strong>哈尔滨、大庆、北京</p>
                   <p><strong>途径路段被共线高速：</strong>G13哈海高速、G45大广高速、G4京港澳高速</p>
                   <p><strong>简介：</strong>包含渤海湾跨海大桥的主线高速</p>
                   `
        },
        {
            id: 'G45',
            名称: 'G45大广高速',
            分组: '冰高速',
            path: [
                [784, 704], [784, 611], [836, 611], [836, 516], [843, 516], [843, 437], [845, 437], [845, 429], [846, 395],
                [862, 395], [936, 390], [941, 375], [954, 368], [956, 243],
            ],
            公路宽度: 3,
            绑定图标ID: ['G45'],
            信息: `                    
                   <h3>G45大广高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>黑龙江省大庆市</p>
                   <p><strong>终点：</strong>广州</p>
                   <p><strong>途径城市：</strong>大庆、郑州、深圳、广州</p>
                   <p><strong>途径路段被共线高速：</strong>G1京哈高速、G13哈海高速、G55二广高速、G4京港澳高速</p>
                   <p><strong>简介：</strong>中国南北走向冰高速路中全线被共线（仅次于京港澳高速）</p>
                   `
        },
        {
            id: 'G4',
            名称: 'G4京港澳高速',
            分组: '冰高速',
            path: [
                [829, 357], [842, 380], [849, 380], [849, 385], [862, 385], [862, 395], [863, 428], [845, 430], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484], [822, 498], [834, 498], [835, 498], [835, 490], [822, 490], [822, 550], [816, 557], [816, 603], [805, 633], [805, 671], [814, 686], [814, 730], [791, 730], [791, 739], [782, 739]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G4京港澳高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>深圳</p>
                   <p><strong>途径城市：</strong>北京、郑州、深圳</p>
                   <p><strong>途径路段被共线高速：</strong>G1京哈高速、G2京沪高速、G3京台高速、G5京昆高速、G14沪拉高速、G45大广高速、G13哈海高速</p>
                   <p><strong>简介：</strong>中国第一条高速公路（开山鼻祖）</p>
                   `
        },
        {
            id: 'G13',
            名称: 'G13哈海高速',
            分组: '冰高速',
            path: [
                [712, 810], [712, 758], [757, 757], [757, 754], [768, 754], [768, 746], [782, 746],
                [782, 739], [791, 739], [791, 730], [814, 730], [814, 686], [805, 671], [805, 633], [816, 603], [816, 557], [822, 550], [822, 490], [822, 484], [829, 483], [830, 445], [835, 444], [836, 438], [844, 436], [846, 395], [862, 395],
            ],
            公路宽度: 3,
            // 绑定图标ID: ['G13'],
            信息: `                    
                   <h3>G13哈海高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>哈尔滨</p>
                   <p><strong>终点：</strong>海口市</p>
                   <p><strong>途径城市：</strong>哈尔滨、大庆、北京、郑州、深圳、广州、海口</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速、G1京哈高速、G45大广高速</p>
                   <p><strong>简介：</strong>第一条到海南的高速公路，但是在北京立交因为共线太多于去年12月被撤销东北共线（在服务器哈尔滨起点告示牌正常显示）</p>
                   `
        },
        {
            id: 'G3',
            名称: 'G3京台高速',
            分组: '冰高速',
            path: [
                [862, 395], [846, 395], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484], [822, 498], [834, 498], [835, 498], [835, 490], [822, 490], [822, 550], [816, 557], [816, 603], [805, 633], [805, 671], [814, 686], [814, 704], [921, 704],
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G3京台高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>台北</p>
                   <p><strong>途径城市：</strong>北京、郑州、台北</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速</p>
                   <p><strong>简介：</strong>与G0迪台国际高速共用一个起点，也是唯一一条通向台湾的冰高速</p>
                   `
        },
        {
            id: 'G2',
            名称: 'G2京沪高速',
            分组: '冰高速',
            path: [
                [862, 395], [846, 395], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484],
                [822, 498], [822, 539], [909, 539]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G2京沪高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>上海</p>
                   <p><strong>途径城市：</strong>北京、郑州、上海</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速、G14沪拉高速</p>
                   <p><strong>简介：</strong>第一条到上海的高速公路<s>（废话）</s></p>
                   `
        },
        {
            id: 'G55',
            名称: 'G55二广高速',
            分组: '冰高速',
            path: [
                [746, 270], [747, 428],
                [790, 429], [790, 610], [784, 611],
                [784, 670], [789, 693], [805, 702], [814, 704], [814, 730], [791, 730]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G55二广高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>二连浩特</p>
                   <p><strong>终点：</strong>广州</p>
                   <p><strong>途径城市：</strong>二连浩特、武汉、深圳、广州</p>
                   <p><strong>途径路段被共线高速：</strong><br>G30沪霍高速<br>G4京港澳高速<br>G45大广高速<br>G13哈海高速</p>
                   <p><strong>简介：</strong>中国第一条山区高速公路</p>
                   `
        },
        {
            id: 'G5',
            名称: 'G5京昆高速',
            分组: '冰高速',
            path: [
                //与京港澳的共线部分直接复制
                [862, 395], [846, 395], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484], [822, 498], [834, 498], [835, 498], [835, 490], [822, 490], [822, 550], [816, 557], [816, 603], [805, 633], [805, 671], [814, 686], [814, 704], [460, 704]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G5京昆高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>瑞丽市（与G0国际高速连接）</p>
                   <p><strong>途径城市：</strong>北京、郑州</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速</p>
                   <p><strong>简介：</strong>中国第一条与国外互通的高速公路</p>
                   `
        },
        {
            id: 'G75',
            名称: 'G75海蓉高速',
            分组: '冰高速',
            path: [
                [720, 758], [720, 683]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G75海蓉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>G13高速海口北立交桥</p>
                   <p><strong>终点：</strong>G14高速安和西立交桥</p>
                   <p><strong>途径城市：</strong>无</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>是广州向中国西北乃至国外的重要干线主线高速</p>
                   `
        },
        {
            id: 'G14',
            名称: 'G14沪拉高速',
            分组: '冰高速',
            path: [
                [909, 539], [822, 539],//经过G2
                [822, 550], [816, 557], [816, 603], [805, 633], [805, 671],//经过G4
                [765, 671], [765, 683], [570, 683], [570, 704], [570, 683], [570, 669], [545, 669], [528, 638], [504, 638], [504, 620], [513, 603], [527, 603], [532, 597], [525, 592], [397, 592], [389, 600], [338, 600], [338, 588]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G14沪拉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>拉萨</p>
                   <p><strong>终点：</strong>上海</p>
                   <p><strong>途径城市：</strong>拉萨、上海</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速（京港高速）、G2京沪高速</p>
                   <p><strong>简介：</strong>中国第一条藏区高原高速公路</p>
                   `
        }, {
            id: 'S2',
            名称: 'S2成都支线',
            分组: '冰高速',
            path: [
                [629, 683], [629, 598],
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>S2成都支线</h3>
                   <p><strong>类别：</strong>省级主线</p>
                   <p><strong>起点：</strong>G14成都南立交</p>
                   <p><strong>终点：</strong>成都</p>
                   <p><strong>途径城市：</strong>成都</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>四川向拉萨、广州和国外城市的重要省级高速</p>
                   `
        }, {
            id: 'G67',
            名称: 'G67乌蓉高速',
            分组: '冰高速',
            path: [
                [638, 349], [638, 382], [665, 382], [665, 561]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G67乌蓉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>乌海市</p>
                   <p><strong>终点：</strong>成都市东</p>
                   <p><strong>途径城市：</strong>乌海、成都</p>
                   <p><strong>途径路段被共线高速：</strong>G6京藏高速</p>
                   <p><strong>简介：</strong>中国唯一跨秦岭仍然保持双向四车道的冰高速路</p>
                   `
        }, {
            id: 'G42',
            名称: 'G42沪蓉高速',
            分组: '冰高速',
            path: [
                [910, 564], [795, 564], [795, 573], [790, 573], [790, 578], [666, 578]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G42沪蓉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>成都市东</p>
                   <p><strong>终点：</strong>上海</p>
                   <p><strong>途径城市：</strong>成都、武汉、上海</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速</p>
                   <p><strong>简介：</strong>中国东西走向高速公路中最短的一条<s>废话</s></p>
                   `
        }, {
            id: 'G17',
            名称: 'G17新藏高速',
            分组: '冰高速',
            path: [
                [353, 345], [344, 450], [344, 574]
            ],
            公路宽度: 3,
            信息: `
                            <h3>G17新藏高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>G30连霍高速巴音郭勒立交桥</p>
                   <p><strong>终点：</strong>拉萨</p>
                   <p><strong>途径城市：</strong>拉萨</p>
                   <p><strong>途径路段被共线高速：</strong>G6京藏高速</p>
                   <p><strong>简介：</strong>中国跨越阶梯爬坡最陡的高速</p>
                   `
        },
        {
            id: 'G6',
            名称: 'G6京藏高速',
            分组: '冰高速',
            path: [[349, 606], [349, 503], [460, 503], [460, 479], [553, 479], [553, 487], [636, 489], [638, 472], [670, 472], [670, 412], [643, 412], [643, 380], [661, 392], [709, 391], [712, 386], [752, 386], [761, 394], [761, 409], [805, 409]]
            ,公路宽度: 3,
            信息: `                    
                   <h3>G6京藏高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>拉萨市</p>
                   <p><strong>途径城市：</strong>北京市、乌海市、拉萨市</p>
                   <p><strong>途径路段被共线高速：</strong>G17新藏高速、G67乌蓉高速、G7京新高速</p>
                   <p><strong>简介：</strong>跨越青藏高原开凿隧道最多的主线高速</p>
                   `
        },
        {
            id: 'G0(National)',
            名称: 'G0(National)迪台高速',
            分组: '冰高速',
            path:  [[917, 734], [350, 734], [330, 723], [280, 723], [260, 711], [-550, 711], [-558, 703], [-558, 631], [-568, 621], [-639, 621], [-649, 631], [-649, 765]]
            ,公路宽度: 3,
            信息: `                    
                   <h3>G0(National)迪台高速</h3>
                   <p><strong>类别：</strong>主线（国际高速）</p>
                   <p><strong>起点：</strong>台北(taipei)</p>
                   <p><strong>终点：</strong>迪拜(Dubai)</p>
                   <p><strong>途径国家：</strong>中国China,缅甸Burma,印度India,孟加拉国Bangladesh,巴基斯坦Pakistan,伊朗Iran,阿拉伯联合酋长国The United Arab Emirates</p>
                   <p><strong>途径路段被共线高速：</strong>G3京台高速（国内），G5京昆高速（国内）</p>
                   <p><strong>简介：</strong>目前唯一连接中国与外国的主线高速</p>
                   `
        },
        {
            id: 'G1(National)',
            名称: 'G1(National)迪阿高速',
            分组: '冰高速',
            path:  [[-649, 765], [-676, 765], [-676, 793], [-701, 793], [-717, 815], [-1104, 815], [-1139, 764], [-1153, 703], [-1183, 640], [-1183, 400]]
            ,公路宽度: 3,
            信息: `                    
                   <h3>G1(National)迪阿高速</h3>
                   <p><strong>类别：</strong>主线（国际高速）</p>
                   <p><strong>起点：</strong>迪拜(Dubai)</p>
                   <p><strong>终点：</strong>阿达纳(Adana)</p>
                   <p><strong>途径国家：</strong>阿拉伯联合酋长国The United Arab Emirates,沙特阿拉伯Saudi Arabia</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong><s>没词了</s></p>
                   `
        },
        {
            id: 'G3(National)',
            名称: 'G3(National)巴格达环线',
            分组: '冰高速',
            path:  [[-649, 765], [-676, 765], [-676, 793], [-701, 793], [-731, 793], [-753, 773], [-799, 773], [-828, 745], [-828, 630], [-802, 604], [-684, 604], [-649, 631], [-649, 765]]
            ,公路宽度: 3,
            信息: `                    
                   <h3>G3(National)巴格达环线</h3>
                   <p><strong>类别：</strong>主线（国际高速）</p>
                   <p><strong>起点：</strong>---</p>
                   <p><strong>终点：</strong>---</p>
                   <p><strong>途径国家：</strong>阿拉伯联合酋长国The United Arab Emirates,伊朗Iran,沙特阿拉伯Saudi Arabia</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>国外第一条环线高速公路</p>
                   `
        },
        {
            id: 'G2(National)',
            名称: 'G2(National)德里高速',
            分组: '冰高速',
            path:  [[-769, 462], [-3008, 462], [-3043, 439], [-3043, 284]]
            ,公路宽度: 3,
            信息: `                    
                   <h3>G2(National)德里高速</h3>
                   <p><strong>类别：</strong>主线（国际高速）</p>
                   <p><strong>起点：</strong>德黑兰(Tehran)</p>
                   <p><strong>终点：</strong>里斯本(Lisboa)</p>
                   <p><strong>途径国家：</strong>伊朗Iran,沙特阿拉伯Saudi Arabia,伊拉克Iraq,叙利亚Syria,突尼斯Tonis,阿尔及利亚Algeria,摩洛哥Morocco,葡萄牙Portugal,</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>中美高速重要组成部分</p>
                   `
        },{
            id: 'G6(National)',
            名称: 'G6(National)纽里高速',
            分组: '冰高速',
            path:  [[-3043, 313],[-3030, 313], [-3030, 256], [-2987, 256], [-2987, 218], [-2955, 218], [-2955, 100], [-6000, 100]]
            ,公路宽度: 3,
            信息: `                    
                   <h3>G6(National)纽里高速</h3>
                   <p><strong>类别：</strong>主线（国际高速）</p>
                   <p><strong>起点：</strong>里斯本(Lisboa)</p>
                   <p><strong>终点：</strong>纽约(New York)</p>
                   <p><strong>途径国家：</strong>葡萄牙Portugal,美国America</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>别名：跨海高速</p>
                   `
        },{
            id: 'G8(National)',
            名称: 'G8(National)迪柏高速',
            分组: '冰高速',
            path:  [[-602, 621], [-602, 592], [-908, 592], [-908, 274], [-1495, 274], [-1495, -150], [-2210, -150]]
            ,公路宽度: 3,
            信息: `                    
                   <h3>G8(National)迪柏高速</h3>
                   <p><strong>类别：</strong>主线（国际高速）</p>
                   <p><strong>起点：</strong>迪拜(Dubai)</p>
                   <p><strong>终点：</strong>柏林(Berlin)</p>
                   <p><strong>途径国家：</strong>伊朗Iran,土耳其(Turkey)[火鸡（bush],保加利亚Bulgaria,罗马尼亚Romania,匈牙利Hungary,斯洛伐克Slovakia,波兰Poland,德国Germany</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>别名：另外一个玩家修建的高速公路</p>
                   `
        },














        //终于到了万众瞩目的混凝土国道部分了
 {
            id: 'G102',
            名称: 'G102',
            分组: '混凝土国道',
            path: [[842, 397], [847, 397], [847, 400], [893, 400], [897, 400], [897, 397], [907, 390], [913, 390], [931, 383], [931, 371], [946, 371], [946, 356], [995, 356], [1000, 290], [1042, 290], [1042, 252]],
            // [946,356],[946, 371],[931, 371],[931, 383], [913, 390],[907, 390], [897, 397],[897, 400],[893, 400],[847, 400],[847, 397],[842, 397],     //G101共线部分
            
            公路宽度: 3,
            信息: `                    
                   <h3>102国道</h3>
                   <p><strong>类别：</strong>国家级别干线公路</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>哈尔滨市</p>
                   <p><strong>Information信息：</strong>中国东北重要干线的国道</p>
                   `
        },
        {
            id: 'g101',
            名称: 'G101',
            分组: '混凝土国道',
            path: [[842, 397], [847, 397], [847, 400], [893, 400], [897, 400], [897, 397], [907, 390], [913, 390], [931, 383], [931, 371], [946, 371], [946, 356], [995, 356]],
                公路宽度: 3,
            信息: `<h3>101国道</h3>
                   <p><strong>类别：</strong>国家级别干线公路</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>沈阳市</p>
                   <p><strong>Information信息：</strong>东北地区首条干线公路</p>`
        },
        {
            id: 'g208',
            名称: 'G208',
            分组: '混凝土国道',
            path: [[764,297],[764,353],[735,353],[735,392]],
            公路宽度: 3,
            信息: `<h3>208国道</h3>
                   <p><strong>类别：</strong>国家级别干线公路</p>
                   <p><strong>起点：</strong>二连浩特市</p>
                   <p><strong>终点：</strong>G109国道（乌兰察布）</p>
                   <p><strong>Information信息：</strong>连接边境小城的国道（？</p>
                   
                   `
        }, {
            id: 'g109',
            名称: 'G109',
            分组: '混凝土国道',
            path: [[841,387],[841,377],[812,377],[812,391],[799,392],[800,392],[789,398],[744,398],[744,392], [702, 392], [702, 382], [662, 382], [662,433], [654,441], [646, 441], [646, 455], [624, 455], [624, 467], [605, 467], [605, 477], [582, 477], [582, 488], [557, 488], [552, 493], [523, 492], [521, 486], [461, 486], [455, 492], [455, 509], [442, 509], [442, 526], [422, 526], [423, 566], [414, 566], [412, 582], [372, 582], [372, 605], [350, 605]],
            公路宽度: 3,
            信息: `<h3>109国道</h3>
                   <p><strong>类别：</strong>国家级别干线公路</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>拉萨市</p>
                   <p><strong>Information信息：</strong>中国第一条进藏国道</p>
                   
                   
                   `
        },
 
         {
            id: 'g312',
            名称: 'G312',
            分组: '混凝土国道',
            path: [[910, 555], [835, 555], [835, 541], [808, 540], [808, 479], [822, 479], [822, 466], [748, 466], [748, 462], [678, 462], [678, 444], [653, 444], [653, 442], [654,441],[662,433],[662,388],[630,388],[630,384],[512,384],[512,360],[348,360],[348, 298],[339, 291], [291, 291], [291, 297], [279, 297], [269, 297], [269, 293], [247, 293], [247, 291], [228, 291], [228, 290], [188, 290], [188, 316], [171, 316], [171, 310], [146, 310]],
            公路宽度: 3
            ,信息: `<h3>312国道</h3>
            <p><strong>起点：</strong>上海市</p>
            <p><strong>终点：</strong>霍尔果斯市</p>
            <p><strong>Information信息：</strong>中国最长国道</p>                 
                   `
        },
         {
            id: 'g106',
            名称: 'G106',
            分组: '混凝土国道',
            path: [[798, 393], [798, 428], [803, 429], [803, 446], [808, 446], [808, 576], [811, 576], [811, 591], [815, 591], [815, 638], [811, 659],[807, 659], [807, 677], [784, 677], [784, 742], [780, 742], [780, 756]]           
            ,公路宽度: 3
            ,信息: `<h3>106国道</h3>
            <p><strong>类别：</strong>国家级别干线公路</p>
            <p><strong>起点：</strong>北京市</p>
            <p><strong>终点：</strong>广州市</p>
            <p><strong>Information信息：</strong>中国南北走向最趋近于直线的国道</p>                 
                   `
        },
        {
            id: 'g107',
            名称: 'G107',
            分组: '混凝土国道',
            path: [[811, 389], [832, 389], [834, 398], [841, 398], [840, 404], [844, 405], [844, 411], [850, 415], [861, 415], [861, 451], [854, 454], [854, 521], [859, 520], [860, 524], [860, 576], [862, 579],[862, 601], [833, 601], [833, 658], [807, 659], [807, 677], [784, 677], [784, 742], [780, 742], [780, 756]]           
            ,公路宽度: 3
            ,信息: `<h3>107国道</h3>
            <p><strong>类别：</strong>国家级别干线公路</p>
            <p><strong>起点：</strong>北京市</p>
            <p><strong>终点：</strong>深圳市</p>
            <p><strong>Information信息：</strong>中国南北走向最长的国道</p>                 
                   `
        },
        {
            id: 'g318',
            名称: 'G318',
            分组: '混凝土国道',
            path: [[915, 600], [862, 600], [862, 601], [833, 601], [815, 601], [815, 591], [774, 591], [774, 583], [726, 583], [722, 587], [713, 587], [708, 590], [675, 590], [675, 595], [656, 595], [656, 614], [649, 620], [559, 620], [558, 628], [552, 628], [552, 652], [560, 652], [560, 633], [548, 633], [548, 612], [420, 612], [417, 613], [400, 613], [400, 610], [389, 610], [389, 611], [372, 611], [372, 605]]           
            ,公路宽度: 3
            ,信息: `<h3>318国道</h3>
            <p><strong>类别：</strong>国家级别干线公路</p>
            <p><strong>起点：</strong>上海市</p>
            <p><strong>终点：</strong>拉萨市</p>
            <p><strong>Information信息：</strong>中国东西走向最趋近于直线的国道</p>                 
                   `
        },
        {
        id: 'g201',
            名称: 'G201',
            分组: '混凝土国道',
            path: [[442, 514], [431, 514], [431, 488], [405, 488], [405, 456], [374, 456], [374, 429], [347, 429], [348,360], [348, 298], [339, 291], [286, 291], [286, 263], [271, 263], [271, 222]]           
            ,公路宽度: 3
            ,信息: `
            <h3>201国道</h3>
            <p><strong>类别：</strong>国家级别干线公路</p>
            <p><strong>起点：</strong>阿勒泰地区</p>
            <p><strong>终点：</strong>G109国道</p>
            <p><strong>Information信息：</strong>中国连接西北地区至西南地区重要国家支线</p>                 
                   `
        },
        {
        id: 'g202',
            名称: 'G202',
            分组: '混凝土国道',
            path: [[657, 595], [637, 595], [637, 548], [651, 547], [651, 537], [656, 537], [656, 506], [665, 506], [665, 482], [660, 482], [660, 469], [645, 469], [645, 454]]           
            ,公路宽度: 3
            ,信息: `<h3>202国道</h3>
            <p><strong>类别：</strong>国家级别干线公路</p>
            <p><strong>起点：</strong>成都市（从318国道“成都东环路”分离出来）</p>
            <p><strong>终点：</strong>G109国道</p>
            <p><strong>Information信息：</strong>中国连接西北地区至成都市的重要国家支线</p>                 
                   `
        },
        {
        id: 'g321',
            名称: 'G321',
            分组: '混凝土国道',
            path: [[658, 609], [669, 609], [673, 613], [673, 700], [745, 700], [745, 750], [773, 750], [773, 756]]           
            ,公路宽度: 3
            ,信息: `<h3>321国道</h3>
            <p><strong>类别：</strong>国家级别干线公路</p>
            <p><strong>起点：</strong>成都市（318国道成都东环路）</p>
            <p><strong>终点：</strong>广州市</p>
            <p><strong>Information信息：</strong>中国西南至华南的重要国家支线</p>                 
                   `
        },
        {
        id: 'g320',
            名称: 'G320',
            分组: '混凝土国道',
            path: [[51, 410], [100, 410], [100, 395], [154, 395], [154, 381], [192, 381], [192, 358], [290, 358], [290, 365], [298, 365], [298, 291]]           
            ,公路宽度: 3
            ,信息: `<h3>320国道</h3>
            <p><strong>类别：</strong>国家级别干线公路</p>
            <p><strong>起点：</strong>喀什地区</p>
            <p><strong>终点：</strong>乌鲁木齐</p>
            <p><strong>Information信息：</strong>绕着塔克拉玛干沙漠北部的公路</p>                 
                   `
        },
        {
        id: 'G312支线',
            名称:'G312支线',
            分组:'其他公路',
            path:[[316, 290], [316,281], [406, 281], [406, 359]]
            ,公路宽度: 3
            ,信息: `<h3>321国道支线</h3>
             `
        },
        {
        id: '国道连接线',
            名称:'国道连接线',
            分组:'其他公路',
            path:[[299, 366], [325,366], [325, 360], [345, 360]]
            ,公路宽度: 3
            ,信息: `<h3>国道连接线</h3>
             `
        },
        {
        id: '乌鲁木齐环线公路',
            名称:'乌鲁木齐环线公路',
            分组:'其他公路',
            path:[[291, 291], [291, 297], [279, 297], [269, 297], [269, 293], [247, 293], [247, 291], [228, 291], [228, 290], [215, 290], [215, 269], [220, 264], [286, 263], [286, 291], [291, 291]]
            ,公路宽度: 3
            ,信息: `<h3>乌鲁木齐环线公路</h3>
             `
        },        
        {
        id: '上海路',
            名称:'上海路',
            分组:'其他公路',
            path:[[238, 271], [238, 290]]
            ,公路宽度: 3
            ,信息: `<h3>上海路</h3>
             `
        },
        {
        id: '张家口路',
            名称:'张家口路',
            分组:'其他公路',
            path:[[215, 270], [242, 270], [242, 264]]
            ,公路宽度: 3
            ,信息: `<h3>张家口路</h3>
             `
        },
        {
        id: '成都环城路',
            名称:'成都环城路',
            分组:'其他公路',
            path:[[620, 620], [620, 613], [612, 613], [612, 599], [616, 595], [637, 595], [656, 595], [656, 614], [649, 620], [620, 620]]
            ,公路宽度: 3
            ,信息: `<h3>成都环城路</h3>
             `
        },
        {
        id: '废弃路',
            名称:'废弃路',
            分组:'其他公路',
            path:[[809, 558], [773, 558]]
            ,公路宽度: 3
            ,信息: `<h3>棍母</h3>
             `
        },
        {
        id: '朝鲜路',
            名称:'朝鲜路',
            分组:'其他公路',
            path:[[946, 371], [988, 371], [988, 396], [1008, 409]]
            ,公路宽度: 3
            ,信息: `<h3><s>通往[朝鲜]太阳（金将军）的地方（嗯，忠诚！）</s></h3>
             `
        },
     ]
};