// 公路数据配置文件
let config = {
    background: {
        // 直接指定背景图URL（可以是本地路径或网络URL）
        url: 'image/地图.png', // 替换为您的背景图路径
    },
    //路线组，你可以按格式创建更多分类
    分组设置: [
        { id: '冰高速', 名称: '冰高速', color: '#6cb5e6ff', visible: true, },
        { id: '混凝土国道', 名称: '混凝土国道', color: '#292929ff', visible: true },
        { id: '损坏', 名称: '损坏的公路', color: '#fe0000ff', visible: false },
        { id: '主要城市', 名称: '城市', color: '#c7c0bfff', visible: true },
        // { id: '唯一识别码，这个不可以重名', 名称: '实际显示的名字', color: '#2ecc71颜色代码呃你随便怎么写', visible: true或者false，是否在网页端显示这条线 }
    ],
    highways: [
        {
            id: 'G0711',//唯一识别码，这个不可以重名    （因为在landmarks.js里也有一个id: 'G0711'，所以下面的landmarkIds不需要再特意指定G0711）
            绑定图标ID: [''],//指定绑定的图标，绑定后选中可以共同高亮显示。如果landmarks.js里图标的id和公路一样则不需要指定这个，默认绑定
            名称: '喀什支线',//实际显示的名字，这个可以重名
            分组: '冰高速',//所属分组，看最上面的分组说明
            //↓这里写公路折线的所有端点，不支持曲线（用曲线也不好看不容易控制）↓
            //用电脑自带《画图》打开，选择取色器或其它什么的在1200*800的图片上移动，左下角就能看见当前坐标，直接抄进方括号里就行
            path: [[5, 370], [84, 370], [89, 360], [126, 358], [127, 350], [142, 350], [147, 345], [157, 345], [157, 335], [173, 335], [173, 323], [196, 321], [201, 315], [211, 315], [250, 315], [250, 317], [270, 315], [270, 308], [292, 308], [292, 315], [314, 315], [338, 315]],
            公路宽度: 3,//线段宽度
            信息:
                `
                    <h3>G0711喀什支线</h3>
                   <p><strong>类别：</strong>支线</p>
                   <p><strong>起点：</strong>G7京新高速乌鲁木齐东南立交桥</p>
                   <p><strong>终点：</strong>新疆维吾尔自治区喀什地区（连通边境）</p>
                   <p><strong>途径城市：</strong>（暂无可发展城市）</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速</p>
                   <p><strong>简介：</strong>有望成为连通欧洲、非洲的中国支线高速公路</p>
                `,
        },
        {
            id: 'G30沪霍',//如果有图标的id也是这个，那么你就可以去掉下面的landmarkIds了（你会自动绑定到那个图标上），这里因为ID不一样，所以必须指定图标ID，否则点击线段只会高亮显示线段，图标是不会跟着亮起来的，而且还会被高亮显示的线段遮住（不会有人喜欢这个吧）
            名称: 'G30沪霍高速',
            分组: '冰高速',
            绑定图标ID: ['G30', 'G30的立交桥'],//冷知识：你可以同时绑定多个图标，你甚至可以这样写['G30','G7京新高速'...]，点击线段会带着图标们一起高亮
            path: [
                [142, 272], [172, 272], [172, 256], [210, 256], [211, 315], [250, 314], [250, 317], [270, 315], [270, 308], [292, 308], [292, 314], [314, 314], [314, 344], [393, 344], [393, 354], [421, 354], [421, 359], [445, 360], [450, 371], [521, 372], [521, 382], [530, 383], [530, 395], [536, 395], [536, 402], [664, 408], [745, 408], [747, 428], [790, 429], [790, 573], [795, 573], [795, 564], [910, 564]
            ],
            公路宽度: 3,
            信息: `                    <h3>G30沪霍高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>上海</p>
                   <p><strong>终点：</strong>新疆维吾尔自治区伊犁哈萨克自治州霍尔果斯市</p>
                   <p><strong>途径城市：</strong>上海、合肥、武汉、延安、乌鲁木齐、霍尔果斯</p>
                   <p><strong>途径路段被共线高速：</strong>S1（新高速）、乌鲁木齐西支线、G0711喀什支线、G55二广高速、G42沪蓉高速</p>
                   <p><strong>简介：</strong>中国最长高速公路</p>`
        },
        {
            id: '乌鲁木齐绕城',//landmarks.js里也有一个id: '乌鲁木齐绕城'，因此不写landmarkIds字段
            名称: 'G0701乌市环线',
            分组: '冰高速',
            path: [
                [210, 255], [210, 243], [215, 237], [260, 236], [260, 243], [279, 245], [279, 254], [290, 254], [290, 273], [286, 275], [260, 276], [253, 271], [238, 270], [236, 266], [210, 265], [210, 255]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G0701乌市环线</h3>
                   <p><strong>类别：</strong>环城高速</p>
                   <p><strong>起点：</strong>---</p>
                   <p><strong>终点：</strong>---</p>
                   <p><strong>途径城市：</strong>乌鲁木齐</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速、G7京新高速</p>
                   <p><strong>简介：</strong>中国第一条环城高速公路</p>`
        },
        {
            id: 'G7',
            名称: 'G7京新高速',
            分组: '冰高速',
            绑定图标ID: ['G7的立交桥'],
            path: [
                [290, 269], [335, 270], [337, 315], [494, 327], [496, 339], [570, 337], [574, 347], [611, 346], [613, 349], [643, 350], [655, 362], [704, 361], [706, 356], [750, 356], [756, 364], [756, 379], [802, 379], [810, 356], [828, 356]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G7京新高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>乌鲁木齐</p>
                   <p><strong>途径城市：</strong>北京、张家口、呼和浩特、乌海市、乌鲁木齐</p>
                   <p><strong>途径路段被共线高速：</strong>G6京藏高速</p>
                   <p><strong>简介：</strong>中国第一条跨沙漠高速公路</p>`
        },
        {
            id: 'G1',
            名称: 'G1京哈高速',
            分组: '冰高速',
            path: [
                [1043, 225], [1043, 267], [956, 267], [954, 339], [981, 339], [954, 339], [954, 368], [941, 375], [936, 390], [862, 395]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G1京哈高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>哈尔滨</p>
                   <p><strong>途径城市：</strong>哈尔滨、大庆、北京</p>
                   <p><strong>途径路段被共线高速：</strong>G13哈海高速、G45大广高速、G4京港澳高速</p>
                   <p><strong>简介：</strong>包含渤海湾跨海大桥的主线高速</p>
                   `
        },
        {
            id: 'G45',
            名称: 'G45大广高速',
            分组: '冰高速',
            path: [
                [784, 704], [784, 611], [836, 611], [836, 516], [843, 516], [843, 437], [845, 437], [845, 429], [846, 395],
                [862, 395], [936, 390], [941, 375], [954, 368], [956, 243],
            ],
            公路宽度: 3,
            绑定图标ID: ['G45'],
            信息: `                    
                   <h3>G45大广高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>黑龙江省大庆市</p>
                   <p><strong>终点：</strong>广州</p>
                   <p><strong>途径城市：</strong>大庆、郑州、深圳、广州</p>
                   <p><strong>途径路段被共线高速：</strong>G1京哈高速、G13哈海高速、G55二广高速、G4京港澳高速</p>
                   <p><strong>简介：</strong>中国南北走向冰高速路中全线被共线（仅次于京港澳高速）</p>
                   `
        },
        {
            id: 'G4',
            名称: 'G4京港澳高速',
            分组: '冰高速',
            path: [
                [829, 357], [842, 380], [849, 380], [849, 385], [862, 385], [862, 395], [863, 428], [845, 430], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484], [822, 498], [834, 498], [835, 498], [835, 490], [822, 490], [822, 550], [816, 557], [816, 603], [805, 633], [805, 671], [814, 686], [814, 730], [791, 730], [791, 739], [782, 739]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G4京港澳高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>深圳</p>
                   <p><strong>途径城市：</strong>北京、郑州、深圳</p>
                   <p><strong>途径路段被共线高速：</strong>G1京哈高速、G2京沪高速、G3京台高速、G5京昆高速、G14沪拉高速、G45大广高速、G13哈海高速</p>
                   <p><strong>简介：</strong>中国第一条高速公路（开山鼻祖）</p>
                   `
        },
        {
            id: 'G13',
            名称: 'G13哈海高速',
            分组: '冰高速',
            path: [
                [712, 810], [712, 758], [757, 757], [757, 754], [768, 754], [768, 746], [782, 746],
                [782, 739], [791, 739], [791, 730], [814, 730], [814, 686], [805, 671], [805, 633], [816, 603], [816, 557], [822, 550], [822, 490], [822, 484], [829, 483], [830, 445], [835, 444], [836, 438], [844, 436], [846, 395], [862, 395],
            ],
            公路宽度: 3,
            // 绑定图标ID: ['G13'],
            信息: `                    
                   <h3>G13哈海高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>哈尔滨</p>
                   <p><strong>终点：</strong>海口市</p>
                   <p><strong>途径城市：</strong>哈尔滨、大庆、北京、郑州、深圳、广州、海口</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速、G1京哈高速、G45大广高速</p>
                   <p><strong>简介：</strong>第一条到海南的高速公路</p>
                   `
        },
        {
            id: 'G3',
            名称: 'G3京台高速',
            分组: '冰高速',
            path: [
                [862, 395], [846, 395], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484], [822, 498], [834, 498], [835, 498], [835, 490], [822, 490], [822, 550], [816, 557], [816, 603], [805, 633], [805, 671], [814, 686], [814, 704], [921, 704],
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G3京台高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>台北</p>
                   <p><strong>途径城市：</strong>北京、郑州、台北</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速</p>
                   <p><strong>简介：</strong>与G0迪台国际高速共用一个起点，也是唯一一条通向台湾的冰高速</p>
                   `
        },
        {
            id: 'G2',
            名称: 'G2京沪高速',
            分组: '冰高速',
            path: [
                [862, 395], [846, 395], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484],
                [822, 498], [822, 539], [909, 539]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G2京沪高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>上海</p>
                   <p><strong>途径城市：</strong>北京、郑州、上海</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速、G14沪拉高速</p>
                   <p><strong>简介：</strong>第一条到上海的高速公路<s>（废话）</s></p>
                   `
        },
        {
            id: 'G55',
            名称: 'G55二广高速',
            分组: '冰高速',
            path: [
                [746, 270], [747, 428],
                [790, 429], [790, 610], [784, 611],
                [784, 670], [789, 693], [805, 702], [814, 704], [814, 730], [791, 730]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G55二广高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>二连浩特</p>
                   <p><strong>终点：</strong>广州</p>
                   <p><strong>途径城市：</strong>二连浩特、武汉、深圳、广州</p>
                   <p><strong>途径路段被共线高速：</strong><br>G30沪霍高速<br>G4京港澳高速<br>G45大广高速<br>G13哈海高速</p>
                   <p><strong>简介：</strong>中国第一条山区高速公路</p>
                   `
        },
        {
            id: 'G5',
            名称: 'G5京昆高速',
            分组: '冰高速',
            path: [
                //与京港澳的共线部分直接复制
                [862, 395], [846, 395], [844, 436], [836, 438], [835, 444], [830, 445], [829, 483], [822, 484], [822, 498], [834, 498], [835, 498], [835, 490], [822, 490], [822, 550], [816, 557], [816, 603], [805, 633], [805, 671], [814, 686], [814, 704], [460, 704]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G5京昆高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>北京</p>
                   <p><strong>终点：</strong>瑞丽市（与G0国际高速连接）</p>
                   <p><strong>途径城市：</strong>北京、郑州</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速</p>
                   <p><strong>简介：</strong>中国第一条与国外互通的高速公路</p>
                   `
        },
        {
            id: 'G75',
            名称: 'G75海蓉高速',
            分组: '冰高速',
            path: [
                [720, 758], [720, 683]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G75海蓉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>G13高速海口北立交桥</p>
                   <p><strong>终点：</strong>G14高速安和西立交桥</p>
                   <p><strong>途径城市：</strong>无</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>是广州向中国西北乃至国外的重要干线主线高速</p>
                   `
        },
        {
            id: 'G14',
            名称: 'G14沪拉高速',
            分组: '冰高速',
            path: [
                [909, 539], [822, 539],//经过G2
                [822, 550], [816, 557], [816, 603], [805, 633], [805, 671],//经过G4
                [765, 671], [765, 683], [570, 683], [570, 704], [570, 683], [570, 669], [545, 669], [528, 638], [504, 638], [504, 620], [513, 603], [527, 603], [532, 597], [525, 592], [397, 592], [389, 600], [338, 600], [338, 588]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G14沪拉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>拉萨</p>
                   <p><strong>终点：</strong>上海</p>
                   <p><strong>途径城市：</strong>拉萨、上海</p>
                   <p><strong>途径路段被共线高速：</strong>G4京港澳高速（京港高速）、G2京沪高速</p>
                   <p><strong>简介：</strong>中国第一条藏区高原高速公路</p>
                   `
        }, {
            id: 'S2',
            名称: 'S2成都支线',
            分组: '冰高速',
            path: [
                [629, 683], [629, 598],
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>S2成都支线</h3>
                   <p><strong>类别：</strong>省级主线</p>
                   <p><strong>起点：</strong>G14成都南立交</p>
                   <p><strong>终点：</strong>成都</p>
                   <p><strong>途径城市：</strong>成都</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>四川向拉萨、广州和国外城市的重要省级高速</p>
                   `
        }, {
            id: 'G67',
            名称: 'G67乌蓉高速',
            分组: '冰高速',
            path: [
                [638, 349], [638, 382], [665, 382], [665, 561]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G67乌蓉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>乌海市</p>
                   <p><strong>终点：</strong>成都市东</p>
                   <p><strong>途径城市：</strong>乌海、成都</p>
                   <p><strong>途径路段被共线高速：</strong>无</p>
                   <p><strong>简介：</strong>中国唯一跨秦岭仍然保持双向四车道的冰高速路</p>
                   `
        }, {
            id: 'G42',
            名称: 'G42沪蓉高速',
            分组: '冰高速',
            path: [
                [910, 564], [795, 564], [795, 573], [790, 573], [790, 578], [666, 578]
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G42沪蓉高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>成都市东</p>
                   <p><strong>终点：</strong>上海</p>
                   <p><strong>途径城市：</strong>成都、武汉、上海</p>
                   <p><strong>途径路段被共线高速：</strong>G30沪霍高速</p>
                   <p><strong>简介：</strong>中国东西走向高速公路中最短的一条<s>废话</s></p>
                   `
        }, {
            id: 'G17',
            名称: 'G17新藏高速',
            分组: '冰高速',
            path: [
                [353, 345], [344, 450], [344, 574]
            ],
            公路宽度: 3,
            信息: `
                            <h3>G17新藏高速</h3>
                   <p><strong>类别：</strong>主线</p>
                   <p><strong>起点：</strong>G30连霍高速巴音郭勒立交桥</p>
                   <p><strong>终点：</strong>拉萨</p>
                   <p><strong>途径城市：</strong>拉萨</p>
                   <p><strong>途径路段被共线高速：</strong>G6京藏高速</p>
                   <p><strong>简介：</strong>中国跨越阶梯爬坡最陡的高速</p>
                   `
        },















        //终于到了万众瞩目的混凝土国道部分了
        {
            id: 'G102',
            名称: 'G102',
            分组: '混凝土国道',
            path: [
                [1042, 252], [1042, 290], [1000, 290], [995, 356],
                // [946,356],[946, 371],[931, 371],[931, 383], [913, 390],[907, 390], [897, 397],[897, 400],[893, 400],[847, 400],[847, 397],[842, 397],     //G101共线部分
            ],
            公路宽度: 3,
            信息: `                    
                   <h3>G102京哈线</h3>
                   <p><strong>类别：</strong>国家级干线公路</p>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>哈尔滨市</p>
                   <p><strong>途径城市：</strong>北京</p>
                   <p><strong>途径城市：</strong>沈阳</p>
                   <p><strong>途径城市：</strong>哈尔滨</p>
                   <p><strong>途径路段被共线国道：</strong>G101京沈线</p>
                   <p><strong>简介：</strong>中国东北重要干线的国道</p>
                   `
        },
        {
            id: 'g101',
            名称: '101国道',
            分组: '混凝土国道',
            path: [[842, 397], [847, 397], [847, 400], [893, 400], [897, 400], [897, 397], [907, 390], [913, 390], [931, 383], [931, 371], [946, 371], [946, 356], [995, 356]],
            公路宽度: 3,
            信息: `<h3>101国道</h3>
                   <p><strong>起点：</strong>北京市</p>
                   <p><strong>终点：</strong>沈阳市</p>
                   <p><strong>Information信息：</strong>东北地区首条干线公路</p>`
        },
        
    ]
};
